<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>Οδηγίες Χρήσης</title>
<link href="../css/style2.css" rel="stylesheet" type="text/css" />
</head>

<body>
<div id="right">
<h2><a>Οδηγίες Χρήσης</a></h2>
<div class="articles">
Από το σχετικό μενού μπορούμε να επιλέξουμε κάποια λειτουργία από τις παρεχόμενες. Την κατηγοριοποίηση (<b>Clasification</b>) και την ανίχνευση μη κανονικών τιμών (<b>Anomaly Detection</b>). Κατά βάση η σελίδα θα μας οδηγήσει σε έλεγχο μιας τιμής που θα εισάγουμε εμείς. Είτε θα γίνει ο έλεγχος για το σε ποια κατηγορία ανήκει η συγκεκριμένη τιμή που είτε θα ελεγχθεί αν η τιμή είναι φυσιολογική με βάση τα δεδομένα που έχουν εισαχθεί μέχρι την στιγμή εκείνη στον εξυπηρετητή (<b>server</b>) ανάλογα με τι θα επιλέξουμε. Ωστόσο αν έχουμε ανεβάσει κάποιο αρχείο δεδομένων η σελίδα θα μας επιστρέψει τα αποτελέσματα με βάσει τα δεδομένα που υπάρχουν στο ανεβασμένο αρχείο. Το αρχείο που ανεβάζουμε διαγράφεται μετά την παρουσίαση αποτελεσμάτων.
<p>Στη συνέχεια μπορούμε να επιστρέψουμε στην αρχική σελίδα ή να επιλέξουμε μια άλλη λειτουργία απο το σχετικό μενού.</p></div>
</div>
</body>
</html>